app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      @artist = Artist.find_by(params[:artist_id]).songs
      if @artist.nil?
        redirect_to artists_path, alert: "Artist not found."
      else
        @songs = @artist.songs
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if params[:artist_id]
      @artist = Artist.find_by(params[:artist_id])
      @song = @artist.songs.find_by(params[:id])
      if @song.nil?
        redirect_to artist_songs_path(@artist), alert: "Song not found."
      end
    else
      @song = Song.find(params[:id])